Tekla Open API Reference for Tekla Structures 2025
ConicalSurface Constructor
Overload List
Name | Description
ConicalSurface(Arc, Double, Double)
 Initializes a new instance of the ConicalSurface class from a base arc, a height and a radius at the top. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
ConicalSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the ConicalSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
ConicalSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the ConicalSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cone). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
ConicalSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the ConicalSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the cone).
Top
See Also
Reference
ConicalSurface Class
Tekla.Structures.Model Namespace